<!-- TOC -->

- [具体说一下cms，画一下图](#具体说一下cms画一下图)
- [hashmap1.7、1.8和concurrentHashiMap1.7 1.8](#hashmap1718和concurrenthashimap17-18)
- [B+树、索引、mysql引擎](#b树索引mysql引擎)
- [redis？源码看过么？（肯定没有啊）](#redis源码看过么肯定没有啊)
- [项目模块图](#项目模块图)
- [一个线程一个页面么？那一个进程一个页面呢](#一个线程一个页面么那一个进程一个页面呢)
- [快排的特殊情况](#快排的特殊情况)
- [类加载器](#类加载器)
- [快速排序的几个关键词：](#快速排序的几个关键词)
- [手写策略模式代码](#手写策略模式代码)
- [查找a,b返回他们共同的根](#查找ab返回他们共同的根)
- [通过层次遍历把二叉树连成表](#通过层次遍历把二叉树连成表)
- [机考第三题想办法降低时间复杂度](#机考第三题想办法降低时间复杂度)
- [栈针里有哪些东西](#栈针里有哪些东西)
- [滑动窗口](#滑动窗口)
- [设计一个死锁](#设计一个死锁)
- [A a = new A()过程](#a-a--new-a过程)
- [类加载机制 为什么要这么加载 好处是什么](#类加载机制-为什么要这么加载-好处是什么)
- [操作系统如何分配空间给JVM JVM内存模型 栈溢出和内存溢出模拟](#操作系统如何分配空间给jvm-jvm内存模型-栈溢出和内存溢出模拟)
- [tcp三次握手 导致Ddos攻击怎么应对](#tcp三次握手-导致ddos攻击怎么应对)
- [禁止对主机的非开放服务的访问](#禁止对主机的非开放服务的访问)
- [限制特定IP地址的访问](#限制特定ip地址的访问)
- [启用防火墙的防DDoS的属性](#启用防火墙的防ddos的属性)
- [严格限制对外开放的服务器的向外访问](#严格限制对外开放的服务器的向外访问)
- [运行端口映射程序祸端口扫描程序，要认真检查特权端口和非特权端口。](#运行端口映射程序祸端口扫描程序要认真检查特权端口和非特权端口)
- [项目里干了什么 表怎么设计的](#项目里干了什么-表怎么设计的)
- [如何使一个不安全的对象编程一个安全对象 除了lock和synchronized除外](#如何使一个不安全的对象编程一个安全对象-除了lock和synchronized除外)
- [一亿个数找出top100](#一亿个数找出top100)
- [寻找节点的共同双亲](#寻找节点的共同双亲)
- [一个数组 找出所有和为n的种类数目](#一个数组-找出所有和为n的种类数目)
- [给定两个稀疏矩阵 求乘法 要优化后的](#给定两个稀疏矩阵-求乘法-要优化后的)

<!-- /TOC -->

## 具体说一下cms，画一下图


| 新生代            | 老年代       | 设计特点（相似设计特特点的肯定是可以搭配使用的） |
|-------------------|--------------|--------------------------------------------------|
| Serial            | Serial Old   | 单线程                                           |
| ParNew            | CMS          | 并发，低停顿时间                                 |
| Parallel Scavenge | Parallel Old | 注重吞吐量                                       |

CMS 收集器流程：

-   初始标记：仅仅只是标记一下GC Roots能直接关联到的对象，速度很快，需要停顿

-   并发标记：进行GC Roots Tracing的过程，它在整个回收过程中耗时最长，不需要停顿

-   重新标记：为了修正并发标记期间因用户程序继续运作而导致标记产生变动的那一部分对象的标记记录，需要停顿。

-   并发清除：不需要停顿。

在整个过程中耗时最长的并发标记和并发清除过程中，收集器线程都可以与用户线程一起工作，不需要停顿。

缺点：

 -  吞吐量低：

-   无法处理浮动垃圾

-   标记 - 清除算法导致的空间碎片

## hashmap1.7、1.8和concurrentHashiMap1.7 1.8


## B+树、索引、mysql引擎


## redis？源码看过么？（肯定没有啊）


键的类型只能为字符串

- String

- List

- SET

- HASH

- ZET

数据结构：

拉链法保存哈希冲突

渐进式 rehash

跳跃表是有序集合的底层实现之一。

跳跃表是基于多指针有序链表实现的，可以看成多个有序链表。又像棵树，每次增大二

计数器

缓存

查找表

消息队列

会话缓存

## 项目模块图


## 一个线程一个页面么？那一个进程一个页面呢

简单说：

主流的chromo模式，就是一个页面一个进程

加上几个渲染进程（Render进程）

还有插件及扩展进程。

原来渲染是在tab进程（）一个页面对应的那个进程里，现在是单独的。

那么问题就又来了（面试官也问我了），

同一个网站的几个页面对应着几个进程。

那么这几个进程怎么通信的

在Chrome中，用到的就是有名管道（Named Pipe），
只不过，它用一个IPC::Channel类，封装了具体的实现细节。

<https://blog.csdn.net/vM199zkg3Y7150u5/article/details/79141638-

<https://www.cnblogs.com/chenliyang/p/6543799.html-

<https://www.cnblogs.com/Benoly/p/4120777.html-

<https://www.xuebuyuan.com/2127237.html-

<https://www.jianshu.com/p/99e450fc04a5-

<https://blog.csdn.net/zuolittletian/article/details/38516375-

从浏览器多进程到JS单线程（以Chrome为例），一个页面一个进程

\*浏览器进程（Browser
进程）——用于处理用户界面和管理所有其他的进程，其运行在浏览器的最顶级；

\*渲染进程（**Render进行：网页的渲染进程，可能有多个。**）——用于处理独立浏览器标签中的渲染，值得注意的是，一个渲染进程能够处理多个标签；

\*插件进程——每个浏览器插件如Adobe
Flash或Java都运行在它们自己的独立进程中，这些插件进程能够与各自的渲染进程互通；

\*扩展进程——浏览器中的扩展也拥有各自的独立进程，以避免互相干扰。

Browser
进程包括主线程，compositor线程，I/O线程，一个或多个资源下载线程，文件操作线程，等等众多线程。其中主线程负责发起网络请求，调用Render进程开始解析HTML和执行JS，接收并响应用户操作（比如用户拖动滚动条）等等。

浏览器资源共享规则

sessionStorange在不同的浏览器窗口共享 ，即使是同一个页面 

localStorage:在所有同源的窗口中都是共享的 

Cookie:在所有同源窗口中都是共享的

## 快排的特殊情况

## 类加载器


## 快速排序的几个关键词：

1、先从数列中取出一个数作为基准数

2、分区过程，将比这个数大的数全放到它的右边，小于或等于它的数全放到它的左边

基准数

小于或等于，概念要封闭起来

手写代码题

## 手写策略模式代码


## 查找a,b返回他们共同的根


不足：返回的不是真正找到没有的情况

解决：递归返回的是一个找到，只能在递归回到根时返回真正情况

## 通过层次遍历把二叉树连成表


不足：队列循环前初始化也要判断空不空，代码重复

确实去掉没关系：只有一个根的话，自己的兄弟就是自己。

## 机考第三题想办法降低时间复杂度


-   原来想的是找出所有情况，数共同朋友最多的。

-   应该想：找朋友的朋友，不是共同朋友，就是朋友。

-   判断不是共同朋友，就是朋友，先给个数组，把是朋友的置为-1。如果是共同朋友的话就+1。

-   这样时间复杂度是O(n2)，而不是O(n3)。

## 栈针里有哪些东西


局部变量表（太大在堆里）

操作数栈

常量池引用

## 滑动窗口


窗口是缓存的一部分，用来暂时释放字节流。发送方和接收方各有一个窗口，接收方通过TCP报文端中的窗口字段告诉

## 设计一个死锁


## A a = new A()过程


三个过程。都是整个过程完了之后再完成子类的。

先加载父类，后加载子类

先加载静态属性，再加载静态代码块

先分配父类特有的属性的堆内存

初始化父类的特有属性，构造代码块

初始化父类的完了之后再初始化子类

## 类加载机制 为什么要这么加载 好处是什么


## 操作系统如何分配空间给JVM JVM内存模型 栈溢出和内存溢出模拟


Java垃圾回收后，释放的内存，不马上归还给操作系统

## tcp三次握手 导致Ddos攻击怎么应对


<https://www.cnblogs.com/2myroad/articles/3881042.html-

拒绝服务攻击（denial-of-service
attack，DoS），亦称洪水攻击，其目的在于使目标电脑的网络或系统资源耗尽，使服务暂时中断或停止，导致其正常用户无法访问。

拒绝服务在这里是无法服务的意思。

分布式拒绝服务攻击（distributed denial-of-service
attack，DDoS），指攻击者使用网络上两个或以上被攻陷的电脑作为“僵尸”向特定的目标发动“拒绝服务”式攻击。

可以维护的SYN_RECV状态超过极限后就不再接受新的SYN报文，也就是拒绝新的TCP连接建立。

缩短SYN半连接的time out 时间。

1. 正确设置防火墙

## 禁止对主机的非开放服务的访问

## 限制特定IP地址的访问

## 启用防火墙的防DDoS的属性

## 严格限制对外开放的服务器的向外访问

## 运行端口映射程序祸端口扫描程序，要认真检查特权端口和非特权端口。

## 项目里干了什么 表怎么设计的


## 如何使一个不安全的对象编程一个安全对象 除了lock和synchronized除外


## 一亿个数找出top100

## 寻找节点的共同双亲


## 一个数组 找出所有和为n的种类数目


排序，前后一块找

## 给定两个稀疏矩阵 求乘法 要优化后的


矩阵乘法：第i行乘以第j列

稀疏矩阵：// 行号，列号， 元素值， int row, colum, value;
